package def

import (
	"fmt"
	"os"
	"strconv"
	"strings"
	"sync"

	"github.com/tealeg/xlsx"
	"reflect"
	"os/exec"
	"path/filepath"
)

type EquipmentVersion struct {
	md5 string //配置表md5数据
}

type EquipmentClass struct {
	EquipmentVersion
}

var Equipmentinstance *EquipmentClass

func EquipmentInstance() *EquipmentClass {
	if Equipmentinstance == nil {
		Equipmentinstance = &EquipmentClass{}
	}
	return Equipmentinstance
}

type Equipment struct {
	Id int32 //
	Name string //名字
	Class int32 //策划用
	Slot int32 //部位
	Rank int32 //阶级
	ValueLv int32 //数值等级
	EquipLv int32 //装备等级
	EquipSource int32 //装备源
	EquipQuality int32 //装备品质
	InnateAffix int32 //天生词缀
	SetBonus int32 //套装加成
	EquipSfx string //外观资源
	AttrID1 int32 //属性
	MinValue1 int32 //属性
	MaxValue1 int32 //属性
	Step1 int32 //步长
	AttrID2 int32 //属性
	MinValue2 int32 //属性
	MaxValue2 int32 //属性
	Step2 int32 //步长
	AttrID3 int32 //属性
	MinValue3 int32 //属性
	MaxValue3 int32 //属性
	Step3 int32 //步长
	AttrID4 int32 //属性
	MinValue4 int32 //属性
	MaxValue4 int32 //属性
	Step4 int32 //步长
	AttrID5 int32 //属性
	MinValue5 int32 //属性
	MaxValue5 int32 //属性
	Step5 int32 //步长
	AttrID6 int32 //属性
	MinValue6 int32 //属性
	MaxValue6 int32 //属性
	Step6 int32 //步长
}

func GetEquipmentByPk(id int32) (itm *Equipment, ok bool) {
	mtxEquipment.RLock()
	itm, ok = cnfEquipment[id]
	mtxEquipment.RUnlock()
	return
}

const (
	Slot_Helm = 1 // 头盔
	Slot_RightHand =2 // 主手
	Slot_LeftHand = 3// 副手
	Slot_ChestArmor = 4 // 胸甲
	Slot_Belt =5// 腰带
	Slot_Pant =6 // 裤子
	Slot_Boot =7 // 靴子
	Slot_Amulet = 8 // 项链
	Slot_Ring =9 // 戒指
	Slot_Brace =10// 护腕
	Slot_Wing = 11 // 翅膀
	Slot_Glove =12 //手套
	Slot_Pauldron = 13 //肩甲
)

const (
	EquipQuality_Normal = 0 //普通装备白蓝黄
	EquipQuality_Legendary = 1 //传奇装备
	EquipQuality_Set  = 2 //绿色套装
)

func SetEquipmentVersion(md5 string) string {
	EquipmentInstance().md5 = md5
	return ``
	}
func GetEquipmentVersion(md5 string) string {
	return EquipmentInstance().md5
}
func GetEquipment() map[int32]*Equipment{
	mtxEquipment.RLock()
	cnf := cnfEquipment
	mtxEquipment.RUnlock()
	return cnf
}

func (this *Equipment) getName() string {
	return this.Name 
}

func (this *Equipment) getClass() int32 {
	return this.Class 
}

func (this *Equipment) getSlot() int32 {
	return this.Slot 
}

func (this *Equipment) getRank() int32 {
	return this.Rank 
}

func (this *Equipment) getValueLv() int32 {
	return this.ValueLv 
}

func (this *Equipment) getEquipLv() int32 {
	return this.EquipLv 
}

func (this *Equipment) getEquipSource() int32 {
	return this.EquipSource 
}

func (this *Equipment) getEquipQuality() int32 {
	return this.EquipQuality 
}

func (this *Equipment) getInnateAffix() int32 {
	return this.InnateAffix 
}

func (this *Equipment) getSetBonus() int32 {
	return this.SetBonus 
}

func (this *Equipment) getEquipSfx() string {
	return this.EquipSfx 
}

func (this *Equipment) getAttrID1() int32 {
	return this.AttrID1 
}

func (this *Equipment) getMinValue1() int32 {
	return this.MinValue1 
}

func (this *Equipment) getMaxValue1() int32 {
	return this.MaxValue1 
}

func (this *Equipment) getStep1() int32 {
	return this.Step1 
}

func (this *Equipment) getAttrID2() int32 {
	return this.AttrID2 
}

func (this *Equipment) getMinValue2() int32 {
	return this.MinValue2 
}

func (this *Equipment) getMaxValue2() int32 {
	return this.MaxValue2 
}

func (this *Equipment) getStep2() int32 {
	return this.Step2 
}

func (this *Equipment) getAttrID3() int32 {
	return this.AttrID3 
}

func (this *Equipment) getMinValue3() int32 {
	return this.MinValue3 
}

func (this *Equipment) getMaxValue3() int32 {
	return this.MaxValue3 
}

func (this *Equipment) getStep3() int32 {
	return this.Step3 
}

func (this *Equipment) getAttrID4() int32 {
	return this.AttrID4 
}

func (this *Equipment) getMinValue4() int32 {
	return this.MinValue4 
}

func (this *Equipment) getMaxValue4() int32 {
	return this.MaxValue4 
}

func (this *Equipment) getStep4() int32 {
	return this.Step4 
}

func (this *Equipment) getAttrID5() int32 {
	return this.AttrID5 
}

func (this *Equipment) getMinValue5() int32 {
	return this.MinValue5 
}

func (this *Equipment) getMaxValue5() int32 {
	return this.MaxValue5 
}

func (this *Equipment) getStep5() int32 {
	return this.Step5 
}

func (this *Equipment) getAttrID6() int32 {
	return this.AttrID6 
}

func (this *Equipment) getMinValue6() int32 {
	return this.MinValue6 
}

func (this *Equipment) getMaxValue6() int32 {
	return this.MaxValue6 
}

func (this *Equipment) getStep6() int32 {
	return this.Step6 
}

func LoadEquipment(file string) string {
	var clen = []int32{36}
	sf := `equipment.xlsx`
	fi, _ := exec.LookPath(os.Args[0])
	pa, _ := filepath.Abs(fi)
	rst := filepath.Dir(pa)
	sf = rst + "/" +"res"+"/" + filepath.Base(sf)
    if file != "" {
        sf = file
    } else {
        _, err := os.Lstat(sf)
        if err != nil && os.IsNotExist(err) {
            sf = "xlsx/" + sf
        }
    }
    f, err := xlsx.OpenFile(sf)
    if err != nil {
        return err.Error()
    }
    if len(f.Sheets[0].Rows) < 5 {
        return sf + " 没有配置内容"
    }
    //slen := int32(len(f.Sheets))
    var rlen []int32
    for _, sheet := range f.Sheets {
		if sheet.Name == "注释页" {
			continue
		}
        rlen = append(rlen, int32(len(sheet.Rows)))
    }
    //flen := int32(len(f.Sheets[0].Rows[3].Cells))
    var val string
    var ok bool
    var r64 int32
    var f64 float64
    _, _, _ = ok, r64, f64
    var shref = []int64{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}
	_ = shref
	cnf := make(map[int32]*Equipment)
	for rdx, row := range f.Sheets[0].Rows[4:] {
		if int32(len(row.Cells)) == 0 || strings.Replace(row.Cells[0].String(), " \t\r\n", ``, -1) == `` {
			continue
		}
		if int32(len(row.Cells)) != clen[0] {
			return fmt.Sprintf(`列数错误，在文件%s的第%d行，期望列数："%d"，实际列数："%d"`, sf, rdx+5, clen[0], len(row.Cells))
		}
		itm := &Equipment{}
		val = strings.Replace(row.Cells[0].String(), " \t\r\n", ``, -1)
		itm.Id, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 0, val)
		}
		val = strings.Replace(row.Cells[1].String(), " \t\r\n", ``, -1)
		itm.Name = val
		val = strings.Replace(row.Cells[2].String(), " \t\r\n", ``, -1)
		itm.Class, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 2, val)
		}
		val = strings.Replace(row.Cells[3].String(), " \t\r\n", ``, -1)
		itm.Slot, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 3, val)
		}
		val = strings.Replace(row.Cells[4].String(), " \t\r\n", ``, -1)
		itm.Rank, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 4, val)
		}
		val = strings.Replace(row.Cells[5].String(), " \t\r\n", ``, -1)
		itm.ValueLv, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 5, val)
		}
		val = strings.Replace(row.Cells[6].String(), " \t\r\n", ``, -1)
		itm.EquipLv, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 6, val)
		}
		val = strings.Replace(row.Cells[7].String(), " \t\r\n", ``, -1)
		itm.EquipSource, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 7, val)
		}
		val = strings.Replace(row.Cells[8].String(), " \t\r\n", ``, -1)
		itm.EquipQuality, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 8, val)
		}
		val = strings.Replace(row.Cells[9].String(), " \t\r\n", ``, -1)
		itm.InnateAffix, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 9, val)
		}
		val = strings.Replace(row.Cells[10].String(), " \t\r\n", ``, -1)
		itm.SetBonus, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 10, val)
		}
		val = strings.Replace(row.Cells[11].String(), " \t\r\n", ``, -1)
		itm.EquipSfx = val
		val = strings.Replace(row.Cells[12].String(), " \t\r\n", ``, -1)
		itm.AttrID1, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 12, val)
		}
		val = strings.Replace(row.Cells[13].String(), " \t\r\n", ``, -1)
		itm.MinValue1, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 13, val)
		}
		val = strings.Replace(row.Cells[14].String(), " \t\r\n", ``, -1)
		itm.MaxValue1, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 14, val)
		}
		val = strings.Replace(row.Cells[15].String(), " \t\r\n", ``, -1)
		itm.Step1, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 15, val)
		}
		val = strings.Replace(row.Cells[16].String(), " \t\r\n", ``, -1)
		itm.AttrID2, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 16, val)
		}
		val = strings.Replace(row.Cells[17].String(), " \t\r\n", ``, -1)
		itm.MinValue2, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 17, val)
		}
		val = strings.Replace(row.Cells[18].String(), " \t\r\n", ``, -1)
		itm.MaxValue2, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 18, val)
		}
		val = strings.Replace(row.Cells[19].String(), " \t\r\n", ``, -1)
		itm.Step2, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 19, val)
		}
		val = strings.Replace(row.Cells[20].String(), " \t\r\n", ``, -1)
		itm.AttrID3, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 20, val)
		}
		val = strings.Replace(row.Cells[21].String(), " \t\r\n", ``, -1)
		itm.MinValue3, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 21, val)
		}
		val = strings.Replace(row.Cells[22].String(), " \t\r\n", ``, -1)
		itm.MaxValue3, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 22, val)
		}
		val = strings.Replace(row.Cells[23].String(), " \t\r\n", ``, -1)
		itm.Step3, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 23, val)
		}
		val = strings.Replace(row.Cells[24].String(), " \t\r\n", ``, -1)
		itm.AttrID4, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 24, val)
		}
		val = strings.Replace(row.Cells[25].String(), " \t\r\n", ``, -1)
		itm.MinValue4, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 25, val)
		}
		val = strings.Replace(row.Cells[26].String(), " \t\r\n", ``, -1)
		itm.MaxValue4, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 26, val)
		}
		val = strings.Replace(row.Cells[27].String(), " \t\r\n", ``, -1)
		itm.Step4, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 27, val)
		}
		val = strings.Replace(row.Cells[28].String(), " \t\r\n", ``, -1)
		itm.AttrID5, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 28, val)
		}
		val = strings.Replace(row.Cells[29].String(), " \t\r\n", ``, -1)
		itm.MinValue5, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 29, val)
		}
		val = strings.Replace(row.Cells[30].String(), " \t\r\n", ``, -1)
		itm.MaxValue5, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 30, val)
		}
		val = strings.Replace(row.Cells[31].String(), " \t\r\n", ``, -1)
		itm.Step5, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 31, val)
		}
		val = strings.Replace(row.Cells[32].String(), " \t\r\n", ``, -1)
		itm.AttrID6, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 32, val)
		}
		val = strings.Replace(row.Cells[33].String(), " \t\r\n", ``, -1)
		itm.MinValue6, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 33, val)
		}
		val = strings.Replace(row.Cells[34].String(), " \t\r\n", ``, -1)
		itm.MaxValue6, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 34, val)
		}
		val = strings.Replace(row.Cells[35].String(), " \t\r\n", ``, -1)
		itm.Step6, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 35, val)
		}
		cnf[itm.Id] = itm
	}
	mtxEquipment.Lock()
	cnfEquipment = cnf
	mtxEquipment.Unlock()
	return ``
}

var _ = strconv.ErrRange
var mtxEquipment = new(sync.RWMutex)
var cnfEquipment = map[int32]*Equipment{
	40001: &Equipment{
		40001, "雷霆之怒·逐风者", 1, 2, 1, 20, 1, 1, 1, 0, 0, "cru_eq01_2", 1001, 1000, 2000, 1, 1002, 100, 200, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40002: &Equipment{
		40002, "巫师会的准则", 1, 3, 2, 20, 1, 2, 1, 0, 0, "cru_eq01_3", 1001, 1000, 2000, 1, 1002, 100, 200, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40003: &Equipment{
		40003, "摄政仁君之凯", 1, 4, 3, 20, 1, 5, 1, 1, 0, "cru_eq01_4", 1001, 1000, 2000, 1, 1002, 100, 200, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40100: &Equipment{
		40100, "骑士巨盔", 0, 1, 4, 20, 1, 1, 1, 0, 0, "", 1001, 1000, 2000, 1, 1002, 120, 220, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40101: &Equipment{
		40101, "巨斧", 1, 2, 5, 20, 1, 1, 1, 1, 0, "", 1001, 1500, 2500, 1, 1002, 140, 240, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40102: &Equipment{
		40102, "钢盾", 1, 3, 6, 20, 1, 1, 2, 1, 0, "", 1001, 2000, 3000, 1, 1002, 160, 260, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40103: &Equipment{
		40103, "乌木胸甲", 0, 4, 7, 20, 1, 1, 1, 1, 0, "cru_eq01_4", 1001, 2500, 3500, 1, 1002, 180, 280, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40104: &Equipment{
		40104, "厚腰带", 0, 5, 8, 20, 1, 1, 1, 2, 0, "", 1001, 3000, 4000, 1, 1002, 200, 300, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40105: &Equipment{
		40105, "乌木裤", 0, 6, 9, 20, 1, 1, 1, 2, 0, "", 1001, 3500, 4500, 1, 1002, 220, 320, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40106: &Equipment{
		40106, "秘银战靴", 0, 7, 10, 20, 1, 1, 1, 2, 0, "", 1001, 4000, 5000, 1, 1002, 240, 340, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40107: &Equipment{
		40107, "宝石项链", 0, 8, 11, 20, 1, 1, 1, 0, 0, "", 1001, 4500, 5500, 1, 1002, 260, 360, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40108: &Equipment{
		40108, "银戒指", 0, 9, 12, 20, 1, 1, 1, 0, 0, "", 1001, 5000, 6000, 1, 1002, 280, 380, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40109: &Equipment{
		40109, "黑钢护腕", 0, 10, 13, 20, 1, 1, 1, 0, 0, "", 1001, 5500, 6500, 1, 1002, 300, 400, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40110: &Equipment{
		40110, "天使之翼", 0, 11, 1, 20, 1, 1, 1, 0, 0, "", 1001, 6000, 7000, 1, 1002, 320, 420, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40111: &Equipment{
		40111, "附魔手套", 0, 12, 1, 20, 1, 1, 1, 0, 0, "", 1001, 6500, 7500, 1, 1002, 340, 440, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	40112: &Equipment{
		40112, "精金护肩", 0, 13, 1, 20, 1, 1, 1, 0, 0, "", 1001, 7000, 8000, 1, 1002, 360, 460, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41000: &Equipment{
		41000, "圣教军武器", 1, 2, 1, 10, 1, 1, 0, 0, 0, "", 1005, 19, 26, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41001: &Equipment{
		41001, "圣教军武器", 1, 2, 1, 20, 1, 1, 0, 0, 0, "", 1005, 29, 39, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41002: &Equipment{
		41002, "圣教军武器", 1, 2, 1, 30, 1, 1, 0, 0, 0, "", 1005, 48, 66, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41003: &Equipment{
		41003, "圣教军武器", 1, 2, 2, 40, 1, 1, 0, 0, 0, "", 1005, 78, 105, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41004: &Equipment{
		41004, "圣教军武器", 1, 2, 2, 50, 1, 1, 0, 0, 0, "", 1005, 127, 171, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41005: &Equipment{
		41005, "圣教军武器", 1, 2, 3, 60, 1, 1, 0, 0, 0, "", 1005, 205, 277, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41006: &Equipment{
		41006, "圣教军武器", 1, 2, 3, 70, 1, 1, 0, 0, 0, "", 1005, 332, 449, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41007: &Equipment{
		41007, "圣教军武器", 1, 2, 4, 80, 1, 1, 0, 0, 0, "", 1005, 537, 727, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41008: &Equipment{
		41008, "圣教军武器", 1, 2, 4, 90, 1, 1, 0, 0, 0, "", 1005, 869, 1177, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41009: &Equipment{
		41009, "圣教军武器", 1, 2, 5, 100, 1, 1, 0, 0, 0, "", 1005, 1407, 1904, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41010: &Equipment{
		41010, "圣教军武器", 1, 2, 6, 103, 1, 1, 0, 0, 0, "", 1005, 1668, 2257, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41011: &Equipment{
		41011, "圣教军武器", 1, 2, 7, 106, 1, 1, 0, 0, 0, "", 1005, 1929, 2610, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41012: &Equipment{
		41012, "圣教军武器", 1, 2, 8, 109, 1, 1, 0, 0, 0, "", 1005, 2190, 2963, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41013: &Equipment{
		41013, "圣教军武器", 1, 2, 9, 113, 1, 1, 0, 0, 0, "", 1005, 2699, 3652, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41014: &Equipment{
		41014, "圣教军武器", 1, 2, 10, 116, 1, 1, 0, 0, 0, "", 1005, 3122, 4224, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41015: &Equipment{
		41015, "圣教军武器", 1, 2, 11, 119, 1, 1, 0, 0, 0, "", 1005, 3544, 4795, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41016: &Equipment{
		41016, "圣教军武器", 1, 2, 12, 122, 1, 1, 0, 0, 0, "", 1005, 4140, 5602, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41017: &Equipment{
		41017, "圣教军武器", 1, 2, 13, 126, 1, 1, 0, 0, 0, "", 1005, 5051, 6834, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41020: &Equipment{
		41020, "圣教军传奇武器", 1, 2, 1, 10, 1, 1, 1, 0, 0, "", 1005, 19, 26, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	41021: &Equipment{
		41021, "圣教军传奇武器", 1, 2, 1, 20, 1, 1, 1, 0, 0, "", 1005, 29, 39, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42000: &Equipment{
		42000, "猎魔人武器", 2, 2, 1, 10, 1, 0, 0, 0, 0, "", 1005, 17, 23, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42001: &Equipment{
		42001, "猎魔人武器", 2, 2, 1, 20, 1, 0, 0, 0, 0, "", 1005, 26, 35, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42002: &Equipment{
		42002, "猎魔人武器", 2, 2, 1, 30, 1, 0, 0, 0, 0, "", 1005, 43, 59, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42003: &Equipment{
		42003, "猎魔人武器", 2, 2, 2, 40, 1, 0, 0, 0, 0, "", 1005, 70, 94, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42004: &Equipment{
		42004, "猎魔人武器", 2, 2, 2, 50, 1, 0, 0, 0, 0, "", 1005, 113, 153, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42005: &Equipment{
		42005, "猎魔人武器", 2, 2, 3, 60, 1, 0, 0, 0, 0, "", 1005, 183, 248, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42006: &Equipment{
		42006, "猎魔人武器", 2, 2, 3, 70, 1, 0, 0, 0, 0, "", 1005, 297, 402, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42007: &Equipment{
		42007, "猎魔人武器", 2, 2, 4, 80, 1, 0, 0, 0, 0, "", 1005, 481, 651, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42008: &Equipment{
		42008, "猎魔人武器", 2, 2, 4, 90, 1, 0, 0, 0, 0, "", 1005, 779, 1054, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42009: &Equipment{
		42009, "猎魔人武器", 2, 2, 5, 100, 1, 0, 0, 0, 0, "", 1005, 1260, 1705, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42010: &Equipment{
		42010, "猎魔人武器", 2, 2, 6, 103, 1, 0, 0, 0, 0, "", 1005, 1494, 2021, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42011: &Equipment{
		42011, "猎魔人武器", 2, 2, 7, 106, 1, 0, 0, 0, 0, "", 1005, 1728, 2338, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42012: &Equipment{
		42012, "猎魔人武器", 2, 2, 8, 109, 1, 0, 0, 0, 0, "", 1005, 1961, 2654, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42013: &Equipment{
		42013, "猎魔人武器", 2, 2, 9, 113, 1, 0, 0, 0, 0, "", 1005, 2418, 3271, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42014: &Equipment{
		42014, "猎魔人武器", 2, 2, 10, 116, 1, 0, 0, 0, 0, "", 1005, 2796, 3783, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42015: &Equipment{
		42015, "猎魔人武器", 2, 2, 11, 119, 1, 0, 0, 0, 0, "", 1005, 3174, 4294, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42016: &Equipment{
		42016, "猎魔人武器", 2, 2, 12, 122, 1, 0, 0, 0, 0, "", 1005, 3708, 5017, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	42017: &Equipment{
		42017, "猎魔人武器", 2, 2, 13, 126, 1, 0, 0, 0, 0, "", 1005, 4524, 6121, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43000: &Equipment{
		43000, "法师武器", 3, 2, 1, 10, 1, 1, 0, 0, 0, "", 1005, 16, 22, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43001: &Equipment{
		43001, "法师武器", 3, 2, 1, 20, 1, 1, 0, 0, 0, "", 1005, 24, 33, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43002: &Equipment{
		43002, "法师武器", 3, 2, 1, 30, 1, 1, 0, 0, 0, "", 1005, 41, 55, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43003: &Equipment{
		43003, "法师武器", 3, 2, 2, 40, 1, 1, 0, 0, 0, "", 1005, 65, 89, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43004: &Equipment{
		43004, "法师武器", 3, 2, 2, 50, 1, 1, 0, 0, 0, "", 1005, 107, 145, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43005: &Equipment{
		43005, "法师武器", 3, 2, 3, 60, 1, 1, 0, 0, 0, "", 1005, 173, 234, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43006: &Equipment{
		43006, "法师武器", 3, 2, 3, 70, 1, 1, 0, 0, 0, "", 1005, 280, 379, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43007: &Equipment{
		43007, "法师武器", 3, 2, 4, 80, 1, 1, 0, 0, 0, "", 1005, 453, 613, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43008: &Equipment{
		43008, "法师武器", 3, 2, 4, 90, 1, 1, 0, 0, 0, "", 1005, 733, 992, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43009: &Equipment{
		43009, "法师武器", 3, 2, 5, 100, 1, 1, 0, 0, 0, "", 1005, 1187, 1606, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43010: &Equipment{
		43010, "法师武器", 3, 2, 6, 103, 1, 1, 0, 0, 0, "", 1005, 1407, 1904, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43011: &Equipment{
		43011, "法师武器", 3, 2, 7, 106, 1, 1, 0, 0, 0, "", 1005, 1627, 2201, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43012: &Equipment{
		43012, "法师武器", 3, 2, 8, 109, 1, 1, 0, 0, 0, "", 1005, 1847, 2499, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43013: &Equipment{
		43013, "法师武器", 3, 2, 9, 113, 1, 1, 0, 0, 0, "", 1005, 2277, 3081, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43014: &Equipment{
		43014, "法师武器", 3, 2, 10, 116, 1, 1, 0, 0, 0, "", 1005, 2633, 3562, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43015: &Equipment{
		43015, "法师武器", 3, 2, 11, 119, 1, 1, 0, 0, 0, "", 1005, 2989, 4044, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43016: &Equipment{
		43016, "法师武器", 3, 2, 12, 122, 1, 1, 0, 0, 0, "", 1005, 3492, 4725, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43017: &Equipment{
		43017, "法师武器", 3, 2, 13, 126, 1, 1, 0, 0, 0, "", 1005, 4261, 5764, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43020: &Equipment{
		43020, "法师传奇武器", 3, 2, 1, 10, 1, 1, 1, 0, 0, "", 1005, 16, 22, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	43021: &Equipment{
		43021, "法师传奇武器", 3, 2, 1, 20, 1, 1, 1, 0, 0, "", 1005, 24, 33, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44000: &Equipment{
		44000, "圣教军副手", 1, 3, 1, 10, 1, 1, 0, 0, 0, "", 1014, 285, 315, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44001: &Equipment{
		44001, "圣教军副手", 1, 3, 1, 20, 1, 1, 0, 0, 0, "", 1014, 570, 630, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44002: &Equipment{
		44002, "圣教军副手", 1, 3, 1, 30, 1, 1, 0, 0, 0, "", 1014, 855, 945, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44003: &Equipment{
		44003, "圣教军副手", 1, 3, 2, 40, 1, 1, 0, 0, 0, "", 1014, 1140, 1260, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44004: &Equipment{
		44004, "圣教军副手", 1, 3, 2, 50, 1, 1, 0, 0, 0, "", 1014, 1425, 1575, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44005: &Equipment{
		44005, "圣教军副手", 1, 3, 3, 60, 1, 1, 0, 0, 0, "", 1014, 1710, 1890, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44006: &Equipment{
		44006, "圣教军副手", 1, 3, 3, 70, 1, 1, 0, 0, 0, "", 1014, 1995, 2205, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44007: &Equipment{
		44007, "圣教军副手", 1, 3, 4, 80, 1, 1, 0, 0, 0, "", 1014, 2280, 2520, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44008: &Equipment{
		44008, "圣教军副手", 1, 3, 4, 90, 1, 1, 0, 0, 0, "", 1014, 2565, 2835, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44009: &Equipment{
		44009, "圣教军副手", 1, 3, 5, 100, 1, 1, 0, 0, 0, "", 1014, 2850, 3150, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44010: &Equipment{
		44010, "圣教军副手", 1, 3, 6, 103, 1, 1, 0, 0, 0, "", 1014, 2935, 3244, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44011: &Equipment{
		44011, "圣教军副手", 1, 3, 7, 106, 1, 1, 0, 0, 0, "", 1014, 3021, 3339, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44012: &Equipment{
		44012, "圣教军副手", 1, 3, 8, 109, 1, 1, 0, 0, 0, "", 1014, 3106, 3433, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44013: &Equipment{
		44013, "圣教军副手", 1, 3, 9, 113, 1, 1, 0, 0, 0, "", 1014, 3220, 3559, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44014: &Equipment{
		44014, "圣教军副手", 1, 3, 10, 116, 1, 1, 0, 0, 0, "", 1014, 3306, 3654, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44015: &Equipment{
		44015, "圣教军副手", 1, 3, 11, 119, 1, 1, 0, 0, 0, "", 1014, 3391, 3748, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44016: &Equipment{
		44016, "圣教军副手", 1, 3, 12, 122, 1, 1, 0, 0, 0, "", 1014, 3477, 3843, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44017: &Equipment{
		44017, "圣教军副手", 1, 3, 13, 126, 1, 1, 0, 0, 0, "", 1014, 3591, 3969, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44020: &Equipment{
		44020, "圣教军传奇副手", 1, 3, 1, 10, 1, 1, 1, 0, 0, "", 1014, 285, 315, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	44021: &Equipment{
		44021, "圣教军传奇副手", 1, 3, 1, 20, 1, 1, 1, 0, 0, "", 1014, 570, 630, 1, 1040, 1500, 3000, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45000: &Equipment{
		45000, "猎魔人副手", 2, 3, 1, 10, 1, 0, 0, 0, 0, "", 1005, 2, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45001: &Equipment{
		45001, "猎魔人副手", 2, 3, 1, 20, 1, 0, 0, 0, 0, "", 1005, 3, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45002: &Equipment{
		45002, "猎魔人副手", 2, 3, 1, 30, 1, 0, 0, 0, 0, "", 1005, 5, 6, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45003: &Equipment{
		45003, "猎魔人副手", 2, 3, 2, 40, 1, 0, 0, 0, 0, "", 1005, 8, 11, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45004: &Equipment{
		45004, "猎魔人副手", 2, 3, 2, 50, 1, 0, 0, 0, 0, "", 1005, 13, 17, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45005: &Equipment{
		45005, "猎魔人副手", 2, 3, 3, 60, 1, 0, 0, 0, 0, "", 1005, 21, 28, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45006: &Equipment{
		45006, "猎魔人副手", 2, 3, 3, 70, 1, 0, 0, 0, 0, "", 1005, 34, 46, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45007: &Equipment{
		45007, "猎魔人副手", 2, 3, 4, 80, 1, 0, 0, 0, 0, "", 1005, 56, 75, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45008: &Equipment{
		45008, "猎魔人副手", 2, 3, 4, 90, 1, 0, 0, 0, 0, "", 1005, 90, 122, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45009: &Equipment{
		45009, "猎魔人副手", 2, 3, 5, 100, 1, 0, 0, 0, 0, "", 1005, 146, 198, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45010: &Equipment{
		45010, "猎魔人副手", 2, 3, 6, 103, 1, 0, 0, 0, 0, "", 1005, 174, 235, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45011: &Equipment{
		45011, "猎魔人副手", 2, 3, 7, 106, 1, 0, 0, 0, 0, "", 1005, 201, 272, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45012: &Equipment{
		45012, "猎魔人副手", 2, 3, 8, 109, 1, 0, 0, 0, 0, "", 1005, 228, 309, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45013: &Equipment{
		45013, "猎魔人副手", 2, 3, 9, 113, 1, 0, 0, 0, 0, "", 1005, 281, 381, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45014: &Equipment{
		45014, "猎魔人副手", 2, 3, 10, 116, 1, 0, 0, 0, 0, "", 1005, 325, 440, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45015: &Equipment{
		45015, "猎魔人副手", 2, 3, 11, 119, 1, 0, 0, 0, 0, "", 1005, 369, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45016: &Equipment{
		45016, "猎魔人副手", 2, 3, 12, 122, 1, 0, 0, 0, 0, "", 1005, 432, 584, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	45017: &Equipment{
		45017, "猎魔人副手", 2, 3, 13, 126, 1, 0, 0, 0, 0, "", 1005, 527, 713, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46000: &Equipment{
		46000, "法师副手", 3, 3, 1, 10, 1, 1, 0, 0, 0, "", 1005, 3, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46001: &Equipment{
		46001, "法师副手", 3, 3, 1, 20, 1, 1, 0, 0, 0, "", 1005, 4, 6, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46002: &Equipment{
		46002, "法师副手", 3, 3, 1, 30, 1, 1, 0, 0, 0, "", 1005, 7, 10, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46003: &Equipment{
		46003, "法师副手", 3, 3, 2, 40, 1, 1, 0, 0, 0, "", 1005, 12, 16, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46004: &Equipment{
		46004, "法师副手", 3, 3, 2, 50, 1, 1, 0, 0, 0, "", 1005, 19, 26, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46005: &Equipment{
		46005, "法师副手", 3, 3, 3, 60, 1, 1, 0, 0, 0, "", 1005, 32, 43, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46006: &Equipment{
		46006, "法师副手", 3, 3, 3, 70, 1, 1, 0, 0, 0, "", 1005, 52, 70, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46007: &Equipment{
		46007, "法师副手", 3, 3, 4, 80, 1, 1, 0, 0, 0, "", 1005, 84, 113, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46008: &Equipment{
		46008, "法师副手", 3, 3, 4, 90, 1, 1, 0, 0, 0, "", 1005, 136, 184, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46009: &Equipment{
		46009, "法师副手", 3, 3, 5, 100, 1, 1, 0, 0, 0, "", 1005, 220, 298, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46010: &Equipment{
		46010, "法师副手", 3, 3, 6, 103, 1, 1, 0, 0, 0, "", 1005, 261, 353, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46011: &Equipment{
		46011, "法师副手", 3, 3, 7, 106, 1, 1, 0, 0, 0, "", 1005, 302, 408, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46012: &Equipment{
		46012, "法师副手", 3, 3, 8, 109, 1, 1, 0, 0, 0, "", 1005, 342, 463, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46013: &Equipment{
		46013, "法师副手", 3, 3, 9, 113, 1, 1, 0, 0, 0, "", 1005, 422, 571, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46014: &Equipment{
		46014, "法师副手", 3, 3, 10, 116, 1, 1, 0, 0, 0, "", 1005, 488, 661, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46015: &Equipment{
		46015, "法师副手", 3, 3, 11, 119, 1, 1, 0, 0, 0, "", 1005, 554, 750, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46016: &Equipment{
		46016, "法师副手", 3, 3, 12, 122, 1, 1, 0, 0, 0, "", 1005, 648, 876, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46017: &Equipment{
		46017, "法师副手", 3, 3, 13, 126, 1, 1, 0, 0, 0, "", 1005, 790, 1069, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46020: &Equipment{
		46020, "法师传奇副手", 3, 3, 1, 10, 1, 1, 1, 0, 0, "", 1005, 3, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	46021: &Equipment{
		46021, "法师传奇副手", 3, 3, 1, 20, 1, 1, 1, 0, 0, "", 1005, 4, 6, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47000: &Equipment{
		47000, "头盔", 0, 1, 1, 10, 1, 1, 0, 0, 0, "", 1014, 142, 157, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47001: &Equipment{
		47001, "头盔", 0, 1, 1, 20, 1, 1, 0, 0, 0, "", 1014, 285, 315, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47002: &Equipment{
		47002, "头盔", 0, 1, 1, 30, 1, 1, 0, 0, 0, "", 1014, 427, 472, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47003: &Equipment{
		47003, "头盔", 0, 1, 2, 40, 1, 1, 0, 0, 0, "", 1014, 570, 630, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47004: &Equipment{
		47004, "头盔", 0, 1, 2, 50, 1, 1, 0, 0, 0, "", 1014, 712, 787, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47005: &Equipment{
		47005, "头盔", 0, 1, 3, 60, 1, 1, 0, 0, 0, "", 1014, 855, 945, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47006: &Equipment{
		47006, "头盔", 0, 1, 3, 70, 1, 1, 0, 0, 0, "", 1014, 997, 1102, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47007: &Equipment{
		47007, "头盔", 0, 1, 4, 80, 1, 1, 0, 0, 0, "", 1014, 1140, 1260, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47008: &Equipment{
		47008, "头盔", 0, 1, 4, 90, 1, 1, 0, 0, 0, "", 1014, 1282, 1417, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47009: &Equipment{
		47009, "头盔", 0, 1, 5, 100, 1, 1, 0, 0, 0, "", 1014, 1425, 1575, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47010: &Equipment{
		47010, "头盔", 0, 1, 6, 103, 1, 1, 0, 0, 0, "", 1014, 1467, 1622, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47011: &Equipment{
		47011, "头盔", 0, 1, 7, 106, 1, 1, 0, 0, 0, "", 1014, 1510, 1669, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47012: &Equipment{
		47012, "头盔", 0, 1, 8, 109, 1, 1, 0, 0, 0, "", 1014, 1553, 1716, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47013: &Equipment{
		47013, "头盔", 0, 1, 9, 113, 1, 1, 0, 0, 0, "", 1014, 1610, 1779, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47014: &Equipment{
		47014, "头盔", 0, 1, 10, 116, 1, 1, 0, 0, 0, "", 1014, 1653, 1827, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47015: &Equipment{
		47015, "头盔", 0, 1, 11, 119, 1, 1, 0, 0, 0, "", 1014, 1695, 1874, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47016: &Equipment{
		47016, "头盔", 0, 1, 12, 122, 1, 1, 0, 0, 0, "", 1014, 1738, 1921, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47017: &Equipment{
		47017, "头盔", 0, 1, 13, 126, 1, 1, 0, 0, 0, "", 1014, 1795, 1984, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47020: &Equipment{
		47020, "传奇头盔", 0, 1, 1, 10, 1, 1, 0, 0, 0, "", 1014, 142, 157, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	47021: &Equipment{
		47021, "传奇头盔", 0, 1, 1, 20, 1, 1, 0, 0, 0, "", 1014, 285, 315, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48000: &Equipment{
		48000, "肩甲", 0, 13, 1, 10, 1, 1, 0, 0, 0, "", 1014, 128, 141, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48001: &Equipment{
		48001, "肩甲", 0, 13, 1, 20, 1, 1, 0, 0, 0, "", 1014, 256, 283, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48002: &Equipment{
		48002, "肩甲", 0, 13, 1, 30, 1, 1, 0, 0, 0, "", 1014, 384, 425, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48003: &Equipment{
		48003, "肩甲", 0, 13, 2, 40, 1, 1, 0, 0, 0, "", 1014, 513, 567, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48004: &Equipment{
		48004, "肩甲", 0, 13, 2, 50, 1, 1, 0, 0, 0, "", 1014, 641, 708, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48005: &Equipment{
		48005, "肩甲", 0, 13, 3, 60, 1, 1, 0, 0, 0, "", 1014, 769, 850, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48006: &Equipment{
		48006, "肩甲", 0, 13, 3, 70, 1, 1, 0, 0, 0, "", 1014, 897, 992, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48007: &Equipment{
		48007, "肩甲", 0, 13, 4, 80, 1, 1, 0, 0, 0, "", 1014, 1026, 1134, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48008: &Equipment{
		48008, "肩甲", 0, 13, 4, 90, 1, 1, 0, 0, 0, "", 1014, 1154, 1275, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48009: &Equipment{
		48009, "肩甲", 0, 13, 5, 100, 1, 1, 0, 0, 0, "", 1014, 1282, 1417, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48010: &Equipment{
		48010, "肩甲", 0, 13, 6, 103, 1, 1, 0, 0, 0, "", 1014, 1320, 1460, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48011: &Equipment{
		48011, "肩甲", 0, 13, 7, 106, 1, 1, 0, 0, 0, "", 1014, 1359, 1502, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48012: &Equipment{
		48012, "肩甲", 0, 13, 8, 109, 1, 1, 0, 0, 0, "", 1014, 1397, 1545, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48013: &Equipment{
		48013, "肩甲", 0, 13, 9, 113, 1, 1, 0, 0, 0, "", 1014, 1449, 1601, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48014: &Equipment{
		48014, "肩甲", 0, 13, 10, 116, 1, 1, 0, 0, 0, "", 1014, 1487, 1644, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48015: &Equipment{
		48015, "肩甲", 0, 13, 11, 119, 1, 1, 0, 0, 0, "", 1014, 1526, 1686, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48016: &Equipment{
		48016, "肩甲", 0, 13, 12, 122, 1, 1, 0, 0, 0, "", 1014, 1564, 1729, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48017: &Equipment{
		48017, "肩甲", 0, 13, 13, 126, 1, 1, 0, 0, 0, "", 1014, 1615, 1786, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48020: &Equipment{
		48020, "传奇肩甲", 0, 13, 1, 10, 1, 1, 1, 0, 0, "", 1014, 128, 141, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	48021: &Equipment{
		48021, "传奇肩甲", 0, 13, 1, 20, 1, 1, 1, 0, 0, "", 1014, 256, 283, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49000: &Equipment{
		49000, "胸甲", 0, 4, 1, 10, 1, 1, 0, 0, 0, "", 1014, 142, 157, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49001: &Equipment{
		49001, "胸甲", 0, 4, 1, 20, 1, 1, 0, 0, 0, "", 1014, 285, 315, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49002: &Equipment{
		49002, "胸甲", 0, 4, 1, 30, 1, 1, 0, 0, 0, "", 1014, 427, 472, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49003: &Equipment{
		49003, "胸甲", 0, 4, 2, 40, 1, 1, 0, 0, 0, "", 1014, 570, 630, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49004: &Equipment{
		49004, "胸甲", 0, 4, 2, 50, 1, 1, 0, 0, 0, "", 1014, 712, 787, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49005: &Equipment{
		49005, "胸甲", 0, 4, 3, 60, 1, 1, 0, 0, 0, "", 1014, 855, 945, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49006: &Equipment{
		49006, "胸甲", 0, 4, 3, 70, 1, 1, 0, 0, 0, "", 1014, 997, 1102, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49007: &Equipment{
		49007, "胸甲", 0, 4, 4, 80, 1, 1, 0, 0, 0, "", 1014, 1140, 1260, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49008: &Equipment{
		49008, "胸甲", 0, 4, 4, 90, 1, 1, 0, 0, 0, "", 1014, 1282, 1417, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49009: &Equipment{
		49009, "胸甲", 0, 4, 5, 100, 1, 1, 0, 0, 0, "", 1014, 1425, 1575, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49010: &Equipment{
		49010, "胸甲", 0, 4, 6, 103, 1, 1, 0, 0, 0, "", 1014, 1467, 1622, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49011: &Equipment{
		49011, "胸甲", 0, 4, 7, 106, 1, 1, 0, 0, 0, "", 1014, 1510, 1669, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49012: &Equipment{
		49012, "胸甲", 0, 4, 8, 109, 1, 1, 0, 0, 0, "", 1014, 1553, 1716, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49013: &Equipment{
		49013, "胸甲", 0, 4, 9, 113, 1, 1, 0, 0, 0, "", 1014, 1610, 1779, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49014: &Equipment{
		49014, "胸甲", 0, 4, 10, 116, 1, 1, 0, 0, 0, "", 1014, 1653, 1827, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49015: &Equipment{
		49015, "胸甲", 0, 4, 11, 119, 1, 1, 0, 0, 0, "", 1014, 1695, 1874, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49016: &Equipment{
		49016, "胸甲", 0, 4, 12, 122, 1, 1, 0, 0, 0, "", 1014, 1738, 1921, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49017: &Equipment{
		49017, "胸甲", 0, 4, 13, 126, 1, 1, 0, 0, 0, "", 1014, 1795, 1984, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49020: &Equipment{
		49020, "传奇胸甲", 0, 4, 1, 10, 1, 1, 0, 0, 0, "", 1014, 142, 157, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	49021: &Equipment{
		49021, "传奇胸甲", 0, 4, 2, 20, 1, 1, 0, 0, 0, "", 1014, 285, 315, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50000: &Equipment{
		50000, "裤子", 0, 6, 1, 10, 1, 1, 0, 0, 0, "", 1014, 142, 157, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50001: &Equipment{
		50001, "裤子", 0, 6, 1, 20, 1, 1, 0, 0, 0, "", 1014, 285, 315, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50002: &Equipment{
		50002, "裤子", 0, 6, 1, 30, 1, 1, 0, 0, 0, "", 1014, 427, 472, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50003: &Equipment{
		50003, "裤子", 0, 6, 2, 40, 1, 1, 0, 0, 0, "", 1014, 570, 630, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50004: &Equipment{
		50004, "裤子", 0, 6, 2, 50, 1, 1, 0, 0, 0, "", 1014, 712, 787, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50005: &Equipment{
		50005, "裤子", 0, 6, 3, 60, 1, 1, 0, 0, 0, "", 1014, 855, 945, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50006: &Equipment{
		50006, "裤子", 0, 6, 3, 70, 1, 1, 0, 0, 0, "", 1014, 997, 1102, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50007: &Equipment{
		50007, "裤子", 0, 6, 4, 80, 1, 1, 0, 0, 0, "", 1014, 1140, 1260, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50008: &Equipment{
		50008, "裤子", 0, 6, 4, 90, 1, 1, 0, 0, 0, "", 1014, 1282, 1417, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50009: &Equipment{
		50009, "裤子", 0, 6, 5, 100, 1, 1, 0, 0, 0, "", 1014, 1425, 1575, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50010: &Equipment{
		50010, "裤子", 0, 6, 6, 103, 1, 1, 0, 0, 0, "", 1014, 1467, 1622, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50011: &Equipment{
		50011, "裤子", 0, 6, 7, 106, 1, 1, 0, 0, 0, "", 1014, 1510, 1669, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50012: &Equipment{
		50012, "裤子", 0, 6, 8, 109, 1, 1, 0, 0, 0, "", 1014, 1553, 1716, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50013: &Equipment{
		50013, "裤子", 0, 6, 9, 113, 1, 1, 0, 0, 0, "", 1014, 1610, 1779, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50014: &Equipment{
		50014, "裤子", 0, 6, 10, 116, 1, 1, 0, 0, 0, "", 1014, 1653, 1827, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50015: &Equipment{
		50015, "裤子", 0, 6, 11, 119, 1, 1, 0, 0, 0, "", 1014, 1695, 1874, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50016: &Equipment{
		50016, "裤子", 0, 6, 12, 122, 1, 1, 0, 0, 0, "", 1014, 1738, 1921, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50017: &Equipment{
		50017, "裤子", 0, 6, 13, 126, 1, 1, 0, 0, 0, "", 1014, 1795, 1984, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50020: &Equipment{
		50020, "传奇裤子", 0, 6, 1, 10, 1, 1, 1, 0, 0, "", 1014, 142, 157, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	50021: &Equipment{
		50021, "传奇裤子", 0, 6, 1, 20, 1, 1, 1, 0, 0, "", 1014, 285, 315, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51000: &Equipment{
		51000, "鞋子", 0, 7, 1, 10, 1, 1, 0, 0, 0, "", 1014, 109, 120, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51001: &Equipment{
		51001, "鞋子", 0, 7, 1, 20, 1, 1, 0, 0, 0, "", 1014, 218, 241, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51002: &Equipment{
		51002, "鞋子", 0, 7, 1, 30, 1, 1, 0, 0, 0, "", 1014, 327, 362, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51003: &Equipment{
		51003, "鞋子", 0, 7, 2, 40, 1, 1, 0, 0, 0, "", 1014, 437, 483, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51004: &Equipment{
		51004, "鞋子", 0, 7, 2, 50, 1, 1, 0, 0, 0, "", 1014, 546, 603, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51005: &Equipment{
		51005, "鞋子", 0, 7, 3, 60, 1, 1, 0, 0, 0, "", 1014, 655, 724, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51006: &Equipment{
		51006, "鞋子", 0, 7, 3, 70, 1, 1, 0, 0, 0, "", 1014, 764, 845, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51007: &Equipment{
		51007, "鞋子", 0, 7, 4, 80, 1, 1, 0, 0, 0, "", 1014, 874, 966, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51008: &Equipment{
		51008, "鞋子", 0, 7, 4, 90, 1, 1, 0, 0, 0, "", 1014, 983, 1086, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51009: &Equipment{
		51009, "鞋子", 0, 7, 5, 100, 1, 1, 0, 0, 0, "", 1014, 1092, 1207, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51010: &Equipment{
		51010, "鞋子", 0, 7, 6, 103, 1, 1, 0, 0, 0, "", 1014, 1125, 1243, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51011: &Equipment{
		51011, "鞋子", 0, 7, 7, 106, 1, 1, 0, 0, 0, "", 1014, 1158, 1279, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51012: &Equipment{
		51012, "鞋子", 0, 7, 8, 109, 1, 1, 0, 0, 0, "", 1014, 1190, 1316, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51013: &Equipment{
		51013, "鞋子", 0, 7, 9, 113, 1, 1, 0, 0, 0, "", 1014, 1234, 1364, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51014: &Equipment{
		51014, "鞋子", 0, 7, 10, 116, 1, 1, 0, 0, 0, "", 1014, 1267, 1400, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51015: &Equipment{
		51015, "鞋子", 0, 7, 11, 119, 1, 1, 0, 0, 0, "", 1014, 1300, 1436, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51016: &Equipment{
		51016, "鞋子", 0, 7, 12, 122, 1, 1, 0, 0, 0, "", 1014, 1332, 1473, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51017: &Equipment{
		51017, "鞋子", 0, 7, 13, 126, 1, 1, 0, 0, 0, "", 1014, 1376, 1521, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51020: &Equipment{
		51020, "传奇鞋子", 0, 7, 1, 10, 1, 1, 1, 0, 0, "", 1014, 109, 120, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	51021: &Equipment{
		51021, "传奇鞋子", 0, 7, 1, 20, 1, 1, 1, 0, 0, "", 1014, 218, 241, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52000: &Equipment{
		52000, "腰带", 0, 5, 1, 10, 1, 1, 0, 0, 0, "", 1014, 95, 105, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52001: &Equipment{
		52001, "腰带", 0, 5, 1, 20, 1, 1, 0, 0, 0, "", 1014, 190, 210, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52002: &Equipment{
		52002, "腰带", 0, 5, 1, 30, 1, 1, 0, 0, 0, "", 1014, 285, 315, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52003: &Equipment{
		52003, "腰带", 0, 5, 2, 40, 1, 1, 0, 0, 0, "", 1014, 380, 420, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52004: &Equipment{
		52004, "腰带", 0, 5, 2, 50, 1, 1, 0, 0, 0, "", 1014, 475, 525, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52005: &Equipment{
		52005, "腰带", 0, 5, 3, 60, 1, 1, 0, 0, 0, "", 1014, 570, 630, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52006: &Equipment{
		52006, "腰带", 0, 5, 3, 70, 1, 1, 0, 0, 0, "", 1014, 665, 735, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52007: &Equipment{
		52007, "腰带", 0, 5, 4, 80, 1, 1, 0, 0, 0, "", 1014, 760, 840, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52008: &Equipment{
		52008, "腰带", 0, 5, 4, 90, 1, 1, 0, 0, 0, "", 1014, 855, 945, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52009: &Equipment{
		52009, "腰带", 0, 5, 5, 100, 1, 1, 0, 0, 0, "", 1014, 950, 1050, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52010: &Equipment{
		52010, "腰带", 0, 5, 6, 103, 1, 1, 0, 0, 0, "", 1014, 978, 1081, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52011: &Equipment{
		52011, "腰带", 0, 5, 7, 106, 1, 1, 0, 0, 0, "", 1014, 1007, 1113, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52012: &Equipment{
		52012, "腰带", 0, 5, 8, 109, 1, 1, 0, 0, 0, "", 1014, 1035, 1144, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52013: &Equipment{
		52013, "腰带", 0, 5, 9, 113, 1, 1, 0, 0, 0, "", 1014, 1073, 1186, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52014: &Equipment{
		52014, "腰带", 0, 5, 10, 116, 1, 1, 0, 0, 0, "", 1014, 1102, 1218, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52015: &Equipment{
		52015, "腰带", 0, 5, 11, 119, 1, 1, 0, 0, 0, "", 1014, 1130, 1249, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52016: &Equipment{
		52016, "腰带", 0, 5, 12, 122, 1, 1, 0, 0, 0, "", 1014, 1159, 1281, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52017: &Equipment{
		52017, "腰带", 0, 5, 13, 126, 1, 1, 0, 0, 0, "", 1014, 1197, 1323, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52020: &Equipment{
		52020, "传奇腰带", 0, 5, 1, 10, 1, 1, 1, 0, 0, "", 1014, 95, 105, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	52021: &Equipment{
		52021, "传奇腰带", 0, 5, 1, 20, 1, 1, 1, 0, 0, "", 1014, 190, 210, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53000: &Equipment{
		53000, "护腕", 0, 10, 1, 10, 1, 1, 0, 0, 0, "", 1014, 80, 89, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53001: &Equipment{
		53001, "护腕", 0, 10, 1, 20, 1, 1, 0, 0, 0, "", 1014, 161, 178, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53002: &Equipment{
		53002, "护腕", 0, 10, 1, 30, 1, 1, 0, 0, 0, "", 1014, 242, 267, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53003: &Equipment{
		53003, "护腕", 0, 10, 2, 40, 1, 1, 0, 0, 0, "", 1014, 323, 357, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53004: &Equipment{
		53004, "护腕", 0, 10, 2, 50, 1, 1, 0, 0, 0, "", 1014, 403, 446, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53005: &Equipment{
		53005, "护腕", 0, 10, 3, 60, 1, 1, 0, 0, 0, "", 1014, 484, 535, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53006: &Equipment{
		53006, "护腕", 0, 10, 3, 70, 1, 1, 0, 0, 0, "", 1014, 565, 624, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53007: &Equipment{
		53007, "护腕", 0, 10, 4, 80, 1, 1, 0, 0, 0, "", 1014, 646, 714, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53008: &Equipment{
		53008, "护腕", 0, 10, 4, 90, 1, 1, 0, 0, 0, "", 1014, 726, 803, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53009: &Equipment{
		53009, "护腕", 0, 10, 5, 100, 1, 1, 0, 0, 0, "", 1014, 807, 892, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53010: &Equipment{
		53010, "护腕", 0, 10, 6, 103, 1, 1, 0, 0, 0, "", 1014, 831, 919, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53011: &Equipment{
		53011, "护腕", 0, 10, 7, 106, 1, 1, 0, 0, 0, "", 1014, 855, 946, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53012: &Equipment{
		53012, "护腕", 0, 10, 8, 109, 1, 1, 0, 0, 0, "", 1014, 880, 972, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53013: &Equipment{
		53013, "护腕", 0, 10, 9, 113, 1, 1, 0, 0, 0, "", 1014, 912, 1008, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53014: &Equipment{
		53014, "护腕", 0, 10, 10, 116, 1, 1, 0, 0, 0, "", 1014, 936, 1035, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53015: &Equipment{
		53015, "护腕", 0, 10, 11, 119, 1, 1, 0, 0, 0, "", 1014, 960, 1062, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53016: &Equipment{
		53016, "护腕", 0, 10, 12, 122, 1, 1, 0, 0, 0, "", 1014, 985, 1088, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53017: &Equipment{
		53017, "护腕", 0, 10, 13, 126, 1, 1, 0, 0, 0, "", 1014, 1017, 1124, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53020: &Equipment{
		53020, "传奇护腕", 0, 10, 1, 10, 1, 1, 1, 0, 0, "", 1014, 80, 89, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	53021: &Equipment{
		53021, "传奇护腕", 0, 10, 1, 20, 1, 1, 1, 0, 0, "", 1014, 161, 178, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54000: &Equipment{
		54000, "手套", 0, 12, 1, 10, 1, 1, 0, 0, 0, "", 1014, 109, 120, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54001: &Equipment{
		54001, "手套", 0, 12, 1, 20, 1, 1, 0, 0, 0, "", 1014, 218, 241, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54002: &Equipment{
		54002, "手套", 0, 12, 1, 30, 1, 1, 0, 0, 0, "", 1014, 327, 362, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54003: &Equipment{
		54003, "手套", 0, 12, 2, 40, 1, 1, 0, 0, 0, "", 1014, 437, 483, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54004: &Equipment{
		54004, "手套", 0, 12, 2, 50, 1, 1, 0, 0, 0, "", 1014, 546, 603, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54005: &Equipment{
		54005, "手套", 0, 12, 3, 60, 1, 1, 0, 0, 0, "", 1014, 655, 724, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54006: &Equipment{
		54006, "手套", 0, 12, 3, 70, 1, 1, 0, 0, 0, "", 1014, 764, 845, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54007: &Equipment{
		54007, "手套", 0, 12, 4, 80, 1, 1, 0, 0, 0, "", 1014, 874, 966, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54008: &Equipment{
		54008, "手套", 0, 12, 4, 90, 1, 1, 0, 0, 0, "", 1014, 983, 1086, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54009: &Equipment{
		54009, "手套", 0, 12, 5, 100, 1, 1, 0, 0, 0, "", 1014, 1092, 1207, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54010: &Equipment{
		54010, "手套", 0, 12, 6, 103, 1, 1, 0, 0, 0, "", 1014, 1125, 1243, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54011: &Equipment{
		54011, "手套", 0, 12, 7, 106, 1, 1, 0, 0, 0, "", 1014, 1158, 1279, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54012: &Equipment{
		54012, "手套", 0, 12, 8, 109, 1, 1, 0, 0, 0, "", 1014, 1190, 1316, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54013: &Equipment{
		54013, "手套", 0, 12, 9, 113, 1, 1, 0, 0, 0, "", 1014, 1234, 1364, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54014: &Equipment{
		54014, "手套", 0, 12, 10, 116, 1, 1, 0, 0, 0, "", 1014, 1267, 1400, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54015: &Equipment{
		54015, "手套", 0, 12, 11, 119, 1, 1, 0, 0, 0, "", 1014, 1300, 1436, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54016: &Equipment{
		54016, "手套", 0, 12, 12, 122, 1, 1, 0, 0, 0, "", 1014, 1332, 1473, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54017: &Equipment{
		54017, "手套", 0, 12, 13, 126, 1, 1, 0, 0, 0, "", 1014, 1376, 1521, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54020: &Equipment{
		54020, "传奇手套", 0, 12, 1, 10, 1, 1, 1, 0, 0, "", 1014, 109, 120, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	54021: &Equipment{
		54021, "传奇手套", 0, 12, 1, 20, 1, 1, 1, 0, 0, "", 1014, 218, 241, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55000: &Equipment{
		55000, "项链", 0, 8, 1, 10, 1, 1, 0, 0, 0, "", 1021, 14, 15, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55001: &Equipment{
		55001, "项链", 0, 8, 1, 20, 1, 1, 0, 0, 0, "", 1021, 28, 31, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55002: &Equipment{
		55002, "项链", 0, 8, 1, 30, 1, 1, 0, 0, 0, "", 1021, 42, 47, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55003: &Equipment{
		55003, "项链", 0, 8, 2, 40, 1, 1, 0, 0, 0, "", 1021, 57, 63, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55004: &Equipment{
		55004, "项链", 0, 8, 2, 50, 1, 1, 0, 0, 0, "", 1021, 71, 78, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55005: &Equipment{
		55005, "项链", 0, 8, 3, 60, 1, 1, 0, 0, 0, "", 1021, 85, 94, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55006: &Equipment{
		55006, "项链", 0, 8, 3, 70, 1, 1, 0, 0, 0, "", 1021, 99, 110, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55007: &Equipment{
		55007, "项链", 0, 8, 4, 80, 1, 1, 0, 0, 0, "", 1021, 114, 126, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55008: &Equipment{
		55008, "项链", 0, 8, 4, 90, 1, 1, 0, 0, 0, "", 1021, 128, 141, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55009: &Equipment{
		55009, "项链", 0, 8, 5, 100, 1, 1, 0, 0, 0, "", 1021, 142, 157, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55010: &Equipment{
		55010, "项链", 0, 8, 6, 103, 1, 1, 0, 0, 0, "", 1021, 146, 162, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55011: &Equipment{
		55011, "项链", 0, 8, 7, 106, 1, 1, 0, 0, 0, "", 1021, 151, 166, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55012: &Equipment{
		55012, "项链", 0, 8, 8, 109, 1, 1, 0, 0, 0, "", 1021, 155, 171, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55013: &Equipment{
		55013, "项链", 0, 8, 9, 113, 1, 1, 0, 0, 0, "", 1021, 161, 177, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55014: &Equipment{
		55014, "项链", 0, 8, 10, 116, 1, 1, 0, 0, 0, "", 1021, 165, 182, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55015: &Equipment{
		55015, "项链", 0, 8, 11, 119, 1, 1, 0, 0, 0, "", 1021, 169, 187, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55016: &Equipment{
		55016, "项链", 0, 8, 12, 122, 1, 1, 0, 0, 0, "", 1021, 173, 192, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55017: &Equipment{
		55017, "项链", 0, 8, 13, 126, 1, 1, 0, 0, 0, "", 1021, 179, 198, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55020: &Equipment{
		55020, "传奇项链", 0, 8, 1, 10, 1, 1, 1, 0, 0, "", 1021, 14, 15, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	55021: &Equipment{
		55021, "传奇项链", 0, 8, 1, 20, 1, 1, 1, 0, 0, "", 1021, 28, 31, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56000: &Equipment{
		56000, "戒指", 0, 9, 1, 10, 1, 1, 0, 0, 0, "", 1021, 14, 15, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56001: &Equipment{
		56001, "戒指", 0, 9, 1, 20, 1, 1, 0, 0, 0, "", 1021, 28, 31, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56002: &Equipment{
		56002, "戒指", 0, 9, 1, 30, 1, 1, 0, 0, 0, "", 1021, 42, 47, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56003: &Equipment{
		56003, "戒指", 0, 9, 2, 40, 1, 1, 0, 0, 0, "", 1021, 57, 63, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56004: &Equipment{
		56004, "戒指", 0, 9, 2, 50, 1, 1, 0, 0, 0, "", 1021, 71, 78, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56005: &Equipment{
		56005, "戒指", 0, 9, 3, 60, 1, 1, 0, 0, 0, "", 1021, 85, 94, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56006: &Equipment{
		56006, "戒指", 0, 9, 3, 70, 1, 1, 0, 0, 0, "", 1021, 99, 110, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56007: &Equipment{
		56007, "戒指", 0, 9, 4, 80, 1, 1, 0, 0, 0, "", 1021, 114, 126, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56008: &Equipment{
		56008, "戒指", 0, 9, 4, 90, 1, 1, 0, 0, 0, "", 1021, 128, 141, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56009: &Equipment{
		56009, "戒指", 0, 9, 5, 100, 1, 1, 0, 0, 0, "", 1021, 142, 157, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56010: &Equipment{
		56010, "戒指", 0, 9, 6, 103, 1, 1, 0, 0, 0, "", 1021, 146, 162, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56011: &Equipment{
		56011, "戒指", 0, 9, 7, 106, 1, 1, 0, 0, 0, "", 1021, 151, 166, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56012: &Equipment{
		56012, "戒指", 0, 9, 8, 109, 1, 1, 0, 0, 0, "", 1021, 155, 171, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56013: &Equipment{
		56013, "戒指", 0, 9, 9, 113, 1, 1, 0, 0, 0, "", 1021, 161, 177, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56014: &Equipment{
		56014, "戒指", 0, 9, 10, 116, 1, 1, 0, 0, 0, "", 1021, 165, 182, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56015: &Equipment{
		56015, "戒指", 0, 9, 11, 119, 1, 1, 0, 0, 0, "", 1021, 169, 187, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56016: &Equipment{
		56016, "戒指", 0, 9, 12, 122, 1, 1, 0, 0, 0, "", 1021, 173, 192, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56017: &Equipment{
		56017, "戒指", 0, 9, 13, 126, 1, 1, 0, 0, 0, "", 1021, 179, 198, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56020: &Equipment{
		56020, "传奇戒指", 0, 9, 1, 10, 1, 1, 1, 0, 0, "", 1021, 14, 15, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	56021: &Equipment{
		56021, "传奇戒指", 0, 9, 1, 20, 1, 1, 1, 0, 0, "", 1021, 28, 31, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57000: &Equipment{
		57000, "翅膀", 0, 11, 1, 10, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57001: &Equipment{
		57001, "翅膀", 0, 11, 1, 20, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57002: &Equipment{
		57002, "翅膀", 0, 11, 1, 30, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57003: &Equipment{
		57003, "翅膀", 0, 11, 2, 40, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57004: &Equipment{
		57004, "翅膀", 0, 11, 2, 50, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57005: &Equipment{
		57005, "翅膀", 0, 11, 3, 60, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57006: &Equipment{
		57006, "翅膀", 0, 11, 3, 70, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57007: &Equipment{
		57007, "翅膀", 0, 11, 4, 80, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57008: &Equipment{
		57008, "翅膀", 0, 11, 4, 90, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57009: &Equipment{
		57009, "翅膀", 0, 11, 5, 100, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57010: &Equipment{
		57010, "翅膀", 0, 11, 6, 103, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57011: &Equipment{
		57011, "翅膀", 0, 11, 7, 106, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57012: &Equipment{
		57012, "翅膀", 0, 11, 8, 109, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57013: &Equipment{
		57013, "翅膀", 0, 11, 9, 113, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57014: &Equipment{
		57014, "翅膀", 0, 11, 10, 116, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57015: &Equipment{
		57015, "翅膀", 0, 11, 11, 119, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57016: &Equipment{
		57016, "翅膀", 0, 11, 12, 122, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
	57017: &Equipment{
		57017, "翅膀", 0, 11, 13, 126, 1, 1, 0, 0, 0, "", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
	},
}

	func Equipment_hot() {
		for _, val := range cnfEquipment	{
			v := reflect.ValueOf(*val)
			t := reflect.TypeOf(*val)
			fmt.Printf("%s",t.Name())
			for k := 0; k < v.NumField(); k++ {
				if strings.Contains(v.Field(k).Type().String(), "_Json") {}
			}
		}
	}