package def

import (
	"fmt"
	"os"
	"strconv"
	"strings"
	"sync"

	"github.com/tealeg/xlsx"
	"reflect"
	"os/exec"
	"path/filepath"
)

type ItemVersion struct {
	md5 string //配置表md5数据
}

type ItemClass struct {
	ItemVersion
}

var Iteminstance *ItemClass

func ItemInstance() *ItemClass {
	if Iteminstance == nil {
		Iteminstance = &ItemClass{}
	}
	return Iteminstance
}

type Item struct {
	Id int32 //唯一ID
	Name string //道具名称
	Icon string //图标
	DropIcon string //掉落图标
	Scale int32 //缩放
	Describe string //描述
	Story string //道具故事
	ItemType int32 //道具类型
	BagType int32 //背包类型
	Function int32 //道具功能
	Parameter string //功能参数
	Quality int32 //品质
	Level int32 //道具等级
	Class int32 //职业需求
	Max int32 //叠加数量
	WhetherBatch int32 //是否可批量使用
	Price int32 //出售价格
	Recovery int32 //回收是否弹出确认面板
	DemandLevel int32 //需求等级
	DemandEexceedingLevel int32 //需求超越等级
	CurrencyType int32 //消耗货币类型
	Number int32 //货币消耗需求
	VipLevel int32 //VIP等级需求
	Guild int32 //公会资格判断
	Amount int32 //充值金额判断
	Notice int32 //掉落是否公告
	Log int32 //是否产生日志
	UseMusic string //使用音效
	DropMusic string //掉落音效
	TipsAction int32 //操作标签
}

func GetItemByPk(id int32) (itm *Item, ok bool) {
	mtxItem.RLock()
	itm, ok = cnfItem[id]
	mtxItem.RUnlock()
	return
}

const (
	ItemType_Gold = 1 // 金币
	ItemType_Platinum = 2 //白金币
	ItemType_Diamond = 3 //钻石
	ItemType_Exp = 4 //经验
	ItemType_Equipment = 11 //装备
	ItemType_Gem = 12//宝石
	ItemType_Jew = 13 //珠宝
	ItemType_GodRune = 14 //神符（符文之语）
	ItemType_Charms = 15 //护身符
	ItemType_LegendGem = 18 //传奇宝石
	ItemType_BuffItem = 30 // 加buff道具
	ItemType_Gift = 31 // 礼包
	ItemType_NormalItem = 40 //普通物品
)

const (
	BagType_Equip = 0 //装备
	BagType_Goods = 1 //道具
	BagType_Matter = 2 //材料
)

const (
	Function_NoFunc = 0 // 无功能
	Function_Gift = 1  //礼包，P1-Pn 礼包dataId
	Function_AddBuff = 2  //加buff，P1-Pn BuffId
	Function_ItemScript = 3 // 道具脚本，P1-Pn脚本名
	Function_OpenUI = 4  //打开功能UI
)

const (
	Quality_White=0 //白色
	Quality_Blue=1 //蓝色
	Quality_Yellow=2 //黄色
	Quality_Golden=3 //暗金
	Quality_Green=4 //绿色
	Quality_AncientGolden=5 //远古暗金
	Quality_AncientGreen=6 //远古绿色
	Quality_PrimeGoledn=7 //太古暗金
	Quality_PrimeGreen=8 //太古绿色
)

const (
	WhetherBatch_No = 0  // 否
	WhetherBatch_Yes = 1  // 是
)

const (
	Recovery_No = 0  // 否
	Recovery_Yes = 1  // 是
)

const (
	CurrencyType_Wyq = 0 //无要求
	CurrencyType_Gold = 1 // 金币
	CurrencyType_Platinum = 2 //白金币
	CurrencyType_Diamond = 3 //钻石
)

const (
	Guild_Wyq = 0 //无要求
	Guild_Jrgh = 1 // 加入公会
)

const (
	Notice_No = 0  // 否
	Notice_Yes = 1  // 是
)

const (
	Log_No = 0  // 否
	Log_Yes = 1  // 是
)

func SetItemVersion(md5 string) string {
	ItemInstance().md5 = md5
	return ``
	}
func GetItemVersion(md5 string) string {
	return ItemInstance().md5
}
func GetItem() map[int32]*Item{
	mtxItem.RLock()
	cnf := cnfItem
	mtxItem.RUnlock()
	return cnf
}

func (this *Item) getName() string {
	return this.Name 
}

func (this *Item) getIcon() string {
	return this.Icon 
}

func (this *Item) getDropIcon() string {
	return this.DropIcon 
}

func (this *Item) getScale() int32 {
	return this.Scale 
}

func (this *Item) getDescribe() string {
	return this.Describe 
}

func (this *Item) getStory() string {
	return this.Story 
}

func (this *Item) getItemType() int32 {
	return this.ItemType 
}

func (this *Item) getBagType() int32 {
	return this.BagType 
}

func (this *Item) getFunction() int32 {
	return this.Function 
}

func (this *Item) getParameter() string {
	return this.Parameter 
}

func (this *Item) getQuality() int32 {
	return this.Quality 
}

func (this *Item) getLevel() int32 {
	return this.Level 
}

func (this *Item) getClass() int32 {
	return this.Class 
}

func (this *Item) getMax() int32 {
	return this.Max 
}

func (this *Item) getWhetherBatch() int32 {
	return this.WhetherBatch 
}

func (this *Item) getPrice() int32 {
	return this.Price 
}

func (this *Item) getRecovery() int32 {
	return this.Recovery 
}

func (this *Item) getDemandLevel() int32 {
	return this.DemandLevel 
}

func (this *Item) getDemandEexceedingLevel() int32 {
	return this.DemandEexceedingLevel 
}

func (this *Item) getCurrencyType() int32 {
	return this.CurrencyType 
}

func (this *Item) getNumber() int32 {
	return this.Number 
}

func (this *Item) getVipLevel() int32 {
	return this.VipLevel 
}

func (this *Item) getGuild() int32 {
	return this.Guild 
}

func (this *Item) getAmount() int32 {
	return this.Amount 
}

func (this *Item) getNotice() int32 {
	return this.Notice 
}

func (this *Item) getLog() int32 {
	return this.Log 
}

func (this *Item) getUseMusic() string {
	return this.UseMusic 
}

func (this *Item) getDropMusic() string {
	return this.DropMusic 
}

func (this *Item) getTipsAction() int32 {
	return this.TipsAction 
}

func LoadItem(file string) string {
	var clen = []int32{30}
	sf := `item.xlsx`
	fi, _ := exec.LookPath(os.Args[0])
	pa, _ := filepath.Abs(fi)
	rst := filepath.Dir(pa)
	sf = rst + "/" +"res"+"/" + filepath.Base(sf)
    if file != "" {
        sf = file
    } else {
        _, err := os.Lstat(sf)
        if err != nil && os.IsNotExist(err) {
            sf = "xlsx/" + sf
        }
    }
    f, err := xlsx.OpenFile(sf)
    if err != nil {
        return err.Error()
    }
    if len(f.Sheets[0].Rows) < 5 {
        return sf + " 没有配置内容"
    }
    //slen := int32(len(f.Sheets))
    var rlen []int32
    for _, sheet := range f.Sheets {
		if sheet.Name == "注释页" {
			continue
		}
        rlen = append(rlen, int32(len(sheet.Rows)))
    }
    //flen := int32(len(f.Sheets[0].Rows[3].Cells))
    var val string
    var ok bool
    var r64 int32
    var f64 float64
    _, _, _ = ok, r64, f64
    var shref = []int64{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}
	_ = shref
	cnf := make(map[int32]*Item)
	for rdx, row := range f.Sheets[0].Rows[4:] {
		if int32(len(row.Cells)) == 0 || strings.Replace(row.Cells[0].String(), " \t\r\n", ``, -1) == `` {
			continue
		}
		if int32(len(row.Cells)) != clen[0] {
			return fmt.Sprintf(`列数错误，在文件%s的第%d行，期望列数："%d"，实际列数："%d"`, sf, rdx+5, clen[0], len(row.Cells))
		}
		itm := &Item{}
		val = strings.Replace(row.Cells[0].String(), " \t\r\n", ``, -1)
		itm.Id, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 0, val)
		}
		val = strings.Replace(row.Cells[1].String(), " \t\r\n", ``, -1)
		itm.Name = val
		val = strings.Replace(row.Cells[2].String(), " \t\r\n", ``, -1)
		itm.Icon = val
		val = strings.Replace(row.Cells[3].String(), " \t\r\n", ``, -1)
		itm.DropIcon = val
		val = strings.Replace(row.Cells[4].String(), " \t\r\n", ``, -1)
		itm.Scale, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 4, val)
		}
		val = strings.Replace(row.Cells[5].String(), " \t\r\n", ``, -1)
		itm.Describe = val
		val = strings.Replace(row.Cells[6].String(), " \t\r\n", ``, -1)
		itm.Story = val
		val = strings.Replace(row.Cells[7].String(), " \t\r\n", ``, -1)
		itm.ItemType, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 7, val)
		}
		val = strings.Replace(row.Cells[8].String(), " \t\r\n", ``, -1)
		itm.BagType, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 8, val)
		}
		val = strings.Replace(row.Cells[9].String(), " \t\r\n", ``, -1)
		itm.Function, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 9, val)
		}
		val = strings.Replace(row.Cells[10].String(), " \t\r\n", ``, -1)
		itm.Parameter = val
		val = strings.Replace(row.Cells[11].String(), " \t\r\n", ``, -1)
		itm.Quality, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 11, val)
		}
		val = strings.Replace(row.Cells[12].String(), " \t\r\n", ``, -1)
		itm.Level, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 12, val)
		}
		val = strings.Replace(row.Cells[13].String(), " \t\r\n", ``, -1)
		itm.Class, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 13, val)
		}
		val = strings.Replace(row.Cells[14].String(), " \t\r\n", ``, -1)
		itm.Max, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 14, val)
		}
		val = strings.Replace(row.Cells[15].String(), " \t\r\n", ``, -1)
		itm.WhetherBatch, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 15, val)
		}
		val = strings.Replace(row.Cells[16].String(), " \t\r\n", ``, -1)
		itm.Price, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 16, val)
		}
		val = strings.Replace(row.Cells[17].String(), " \t\r\n", ``, -1)
		itm.Recovery, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 17, val)
		}
		val = strings.Replace(row.Cells[18].String(), " \t\r\n", ``, -1)
		itm.DemandLevel, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 18, val)
		}
		val = strings.Replace(row.Cells[19].String(), " \t\r\n", ``, -1)
		itm.DemandEexceedingLevel, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 19, val)
		}
		val = strings.Replace(row.Cells[20].String(), " \t\r\n", ``, -1)
		itm.CurrencyType, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 20, val)
		}
		val = strings.Replace(row.Cells[21].String(), " \t\r\n", ``, -1)
		itm.Number, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 21, val)
		}
		val = strings.Replace(row.Cells[22].String(), " \t\r\n", ``, -1)
		itm.VipLevel, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 22, val)
		}
		val = strings.Replace(row.Cells[23].String(), " \t\r\n", ``, -1)
		itm.Guild, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 23, val)
		}
		val = strings.Replace(row.Cells[24].String(), " \t\r\n", ``, -1)
		itm.Amount, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 24, val)
		}
		val = strings.Replace(row.Cells[25].String(), " \t\r\n", ``, -1)
		itm.Notice, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 25, val)
		}
		val = strings.Replace(row.Cells[26].String(), " \t\r\n", ``, -1)
		itm.Log, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 26, val)
		}
		val = strings.Replace(row.Cells[27].String(), " \t\r\n", ``, -1)
		itm.UseMusic = val
		val = strings.Replace(row.Cells[28].String(), " \t\r\n", ``, -1)
		itm.DropMusic = val
		val = strings.Replace(row.Cells[29].String(), " \t\r\n", ``, -1)
		itm.TipsAction, err = getInt(val)
		if err != nil {
			return fmt.Sprintf(`int解析失败，在文件%s的第%d行第%d列，值为：%s`, sf, rdx+5, 29, val)
		}
		cnf[itm.Id] = itm
	}
	mtxItem.Lock()
	cnfItem = cnf
	mtxItem.Unlock()
	return ``
}

var _ = strconv.ErrRange
var mtxItem = new(sync.RWMutex)
var cnfItem = map[int32]*Item{
	1: &Item{
		1, "金币", "icon_00", "", 100, "游戏金币", "", 1, 1, 0, "", 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	2: &Item{
		2, "白金币", "icon_01", "", 100, "活动赠送", "", 2, 1, 0, "", 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	3: &Item{
		3, "钻石", "icon_02", "", 100, "充值获得", "", 3, 1, 0, "", 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	4: &Item{
		4, "经验", "icon_03", "", 100, "经验值", "", 4, 1, 0, "", 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	101: &Item{
		101, "铸魂材料", "icon_06", "", 100, "强化装备", "", 40, 2, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	102: &Item{
		102, "灵魂石", "icon_05", "", 100, "赫拉迪克方块升级", "", 40, 2, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	201: &Item{
		201, "礼包", "icon_00", "", 100, "开启可获得以下道具", "", 31, 1, 1, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 102, 
	},
	1001: &Item{
		1001, "白宝石1级", "icon_05", "", 100, "全抗性+5", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1002: &Item{
		1002, "白宝石2级", "icon_05", "", 100, "全抗性+10", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1003: &Item{
		1003, "白宝石3级", "icon_05", "", 100, "全抗性+15", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1004: &Item{
		1004, "白宝石4级", "icon_05", "", 100, "全抗性+20", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1005: &Item{
		1005, "白宝石5级", "icon_05", "", 100, "全抗性+25", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1006: &Item{
		1006, "白宝石6级", "icon_05", "", 100, "全抗性+30", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1007: &Item{
		1007, "白宝石7级", "icon_05", "", 100, "全抗性+35", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1008: &Item{
		1008, "白宝石8级", "icon_05", "", 100, "全抗性+40", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1009: &Item{
		1009, "白宝石9级", "icon_05", "", 100, "全抗性+45", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1010: &Item{
		1010, "白宝石10级", "icon_05", "", 100, "全抗性+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 118, 
	},
	1011: &Item{
		1011, "紫宝石1级", "icon_05", "", 100, "生命值+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1012: &Item{
		1012, "紫宝石2级", "icon_05", "", 100, "生命值+100", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1013: &Item{
		1013, "紫宝石3级", "icon_05", "", 100, "生命值+150", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1014: &Item{
		1014, "紫宝石4级", "icon_05", "", 100, "生命值+200", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1015: &Item{
		1015, "紫宝石5级", "icon_05", "", 100, "生命值+250", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1016: &Item{
		1016, "紫宝石6级", "icon_05", "", 100, "生命值+300", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1017: &Item{
		1017, "紫宝石7级", "icon_05", "", 100, "生命值+350", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1018: &Item{
		1018, "紫宝石8级", "icon_05", "", 100, "生命值+400", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1019: &Item{
		1019, "紫宝石9级", "icon_05", "", 100, "生命值+450", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1020: &Item{
		1020, "紫宝石10级", "icon_05", "", 100, "生命值+500", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1021: &Item{
		1021, "红宝石1级", "icon_05", "", 100, "攻击力+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1022: &Item{
		1022, "红宝石2级", "icon_05", "", 100, "攻击力+100", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1023: &Item{
		1023, "红宝石3级", "icon_05", "", 100, "攻击力+150", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1024: &Item{
		1024, "红宝石4级", "icon_05", "", 100, "攻击力+200", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1025: &Item{
		1025, "红宝石5级", "icon_05", "", 100, "攻击力+250", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1026: &Item{
		1026, "红宝石6级", "icon_05", "", 100, "攻击力+300", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1027: &Item{
		1027, "红宝石7级", "icon_05", "", 100, "攻击力+350", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1028: &Item{
		1028, "红宝石8级", "icon_05", "", 100, "攻击力+400", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1029: &Item{
		1029, "红宝石9级", "icon_05", "", 100, "攻击力+450", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1030: &Item{
		1030, "红宝石10级", "icon_05", "", 100, "攻击力+500", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1031: &Item{
		1031, "绿宝石1级", "icon_05", "", 100, "生命恢复+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1032: &Item{
		1032, "绿宝石2级", "icon_05", "", 100, "生命恢复+100", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1033: &Item{
		1033, "绿宝石3级", "icon_05", "", 100, "生命恢复+150", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1034: &Item{
		1034, "绿宝石4级", "icon_05", "", 100, "生命恢复+200", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1035: &Item{
		1035, "绿宝石5级", "icon_05", "", 100, "生命恢复+250", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1036: &Item{
		1036, "绿宝石6级", "icon_05", "", 100, "生命恢复+300", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1037: &Item{
		1037, "绿宝石7级", "icon_05", "", 100, "生命恢复+350", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1038: &Item{
		1038, "绿宝石8级", "icon_05", "", 100, "生命恢复+400", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1039: &Item{
		1039, "绿宝石9级", "icon_05", "", 100, "生命恢复+450", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1040: &Item{
		1040, "绿宝石10级", "icon_05", "", 100, "生命恢复+500", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1041: &Item{
		1041, "黄宝石1级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1042: &Item{
		1042, "黄宝石2级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1043: &Item{
		1043, "黄宝石3级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1044: &Item{
		1044, "黄宝石4级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1045: &Item{
		1045, "黄宝石5级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1046: &Item{
		1046, "黄宝石6级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1047: &Item{
		1047, "黄宝石7级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1048: &Item{
		1048, "黄宝石8级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1049: &Item{
		1049, "黄宝石9级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1050: &Item{
		1050, "黄宝石10级", "icon_05", "", 100, "荆棘+50", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1051: &Item{
		1051, "多彩宝石1级", "icon_05", "", 100, "最大生命值+11%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1052: &Item{
		1052, "多彩宝石2级", "icon_05", "", 100, "最大生命值+12%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1053: &Item{
		1053, "多彩宝石3级", "icon_05", "", 100, "最大生命值+13%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1054: &Item{
		1054, "多彩宝石4级", "icon_05", "", 100, "最大生命值+14%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1055: &Item{
		1055, "多彩宝石5级", "icon_05", "", 100, "最大生命值+15%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1056: &Item{
		1056, "多彩宝石6级", "icon_05", "", 100, "最大生命值+16%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1057: &Item{
		1057, "多彩宝石7级", "icon_05", "", 100, "最大生命值+17%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1058: &Item{
		1058, "多彩宝石8级", "icon_05", "", 100, "最大生命值+18%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1059: &Item{
		1059, "多彩宝石9级", "icon_05", "", 100, "最大生命值+19%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1060: &Item{
		1060, "多彩宝石10级", "icon_05", "", 100, "最大生命值+20%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1061: &Item{
		1061, "炫彩宝石1级", "icon_05", "", 100, "技能加速+8.0%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1062: &Item{
		1062, "炫彩宝石2级", "icon_05", "", 100, "技能加速+8.5%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1063: &Item{
		1063, "炫彩宝石3级", "icon_05", "", 100, "技能加速+9.0%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1064: &Item{
		1064, "炫彩宝石4级", "icon_05", "", 100, "技能加速+9.5%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1065: &Item{
		1065, "炫彩宝石5级", "icon_05", "", 100, "技能加速+10.0%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1066: &Item{
		1066, "炫彩宝石6级", "icon_05", "", 100, "技能加速+10.5%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1067: &Item{
		1067, "炫彩宝石7级", "icon_05", "", 100, "技能加速+11.0%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1068: &Item{
		1068, "炫彩宝石8级", "icon_05", "", 100, "技能加速+11.5%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1069: &Item{
		1069, "炫彩宝石9级", "icon_05", "", 100, "技能加速+12.0%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1070: &Item{
		1070, "炫彩宝石10级", "icon_05", "", 100, "技能加速+12.5%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1071: &Item{
		1071, "彩虹宝石1级", "icon_05", "", 100, "对精英怪伤害+6%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1072: &Item{
		1072, "彩虹宝石2级", "icon_05", "", 100, "对精英怪伤害+7%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1073: &Item{
		1073, "彩虹宝石3级", "icon_05", "", 100, "对精英怪伤害+8%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1074: &Item{
		1074, "彩虹宝石4级", "icon_05", "", 100, "对精英怪伤害+9%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1075: &Item{
		1075, "彩虹宝石5级", "icon_05", "", 100, "对精英怪伤害+10%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1076: &Item{
		1076, "彩虹宝石6级", "icon_05", "", 100, "对精英怪伤害+11%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1077: &Item{
		1077, "彩虹宝石7级", "icon_05", "", 100, "对精英怪伤害+12%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1078: &Item{
		1078, "彩虹宝石8级", "icon_05", "", 100, "对精英怪伤害+13%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1079: &Item{
		1079, "彩虹宝石9级", "icon_05", "", 100, "对精英怪伤害+14%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1080: &Item{
		1080, "彩虹宝石10级", "icon_05", "", 100, "对精英怪伤害+15%", "", 12, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1081: &Item{
		1081, "活力宝石", "icon_05", "", 100, "我是1号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1082: &Item{
		1082, "至简之力", "icon_05", "", 100, "我是2号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1083: &Item{
		1083, "受罚者之灾", "icon_05", "", 100, "我是3号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1084: &Item{
		1084, "困者之灾", "icon_05", "", 100, "我是4号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1085: &Item{
		1085, "闪电华冠", "icon_05", "", 100, "我是5号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1086: &Item{
		1086, "火牛羚砂囊", "icon_05", "", 100, "我是6号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1087: &Item{
		1087, "银河，阿尔塔夏之泪", "icon_05", "", 100, "我是7号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1088: &Item{
		1088, "强者之灾", "icon_05", "", 100, "我是8号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1089: &Item{
		1089, "毁伤", "icon_05", "", 100, "我是9号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1090: &Item{
		1090, "魄罗芯片", "icon_05", "", 100, "我是10号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1091: &Item{
		1091, "复仇", "icon_05", "", 100, "我是10号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1092: &Item{
		1092, "冰晶", "icon_05", "", 100, "我是10号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1093: &Item{
		1093, "挚诚", "icon_05", "", 100, "我是10号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1094: &Item{
		1094, "剧毒", "icon_05", "", 100, "我是10号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1095: &Item{
		1095, "重伤", "icon_05", "", 100, "我是10号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1096: &Item{
		1096, "免死", "icon_05", "", 100, "我是10号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	1097: &Item{
		1097, "太极", "icon_05", "", 100, "我是10号传奇", "", 18, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10001: &Item{
		10001, "1号神符", "icon_05", "", 100, "我是1号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10002: &Item{
		10002, "2号神符", "icon_05", "", 100, "我是2号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10003: &Item{
		10003, "3号神符", "icon_05", "", 100, "我是3号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10004: &Item{
		10004, "4号神符", "icon_05", "", 100, "我是4号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10005: &Item{
		10005, "5号神符", "icon_05", "", 100, "我是5号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10006: &Item{
		10006, "6号神符", "icon_05", "", 100, "我是6号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10007: &Item{
		10007, "7号神符", "icon_05", "", 100, "我是7号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10008: &Item{
		10008, "8号神符", "icon_05", "", 100, "我是8号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10009: &Item{
		10009, "9号神符", "icon_05", "", 100, "我是9号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10010: &Item{
		10010, "10号神符", "icon_05", "", 100, "我是10号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10011: &Item{
		10011, "11号神符", "icon_05", "", 100, "我是11号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10012: &Item{
		10012, "12号神符", "icon_05", "", 100, "我是12号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10013: &Item{
		10013, "13号神符", "icon_05", "", 100, "我是13号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10014: &Item{
		10014, "14号神符", "icon_05", "", 100, "我是14号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10015: &Item{
		10015, "15号神符", "icon_05", "", 100, "我是15号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10016: &Item{
		10016, "16号神符", "icon_05", "", 100, "我是16号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10017: &Item{
		10017, "17号神符", "icon_05", "", 100, "我是17号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10018: &Item{
		10018, "18号神符", "icon_05", "", 100, "我是18号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10019: &Item{
		10019, "19号神符", "icon_05", "", 100, "我是19号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10020: &Item{
		10020, "20号神符", "icon_05", "", 100, "我是20号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10021: &Item{
		10021, "21号神符", "icon_05", "", 100, "我是21号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10022: &Item{
		10022, "22号神符", "icon_05", "", 100, "我是22号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10023: &Item{
		10023, "23号神符", "icon_05", "", 100, "我是23号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10024: &Item{
		10024, "24号神符", "icon_05", "", 100, "我是24号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10025: &Item{
		10025, "25号神符", "icon_05", "", 100, "我是25号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10026: &Item{
		10026, "26号神符", "icon_05", "", 100, "我是26号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10027: &Item{
		10027, "27号神符", "icon_05", "", 100, "我是27号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10028: &Item{
		10028, "28号神符", "icon_05", "", 100, "我是28号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10029: &Item{
		10029, "29号神符", "icon_05", "", 100, "我是29号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	10030: &Item{
		10030, "30号神符", "icon_05", "", 100, "我是30号神符", "", 14, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	15001: &Item{
		15001, "神奇小护符", "icon_05", "", 100, "我是小护符", "", 15, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	15002: &Item{
		15002, "神奇大护符", "icon_05", "", 100, "我是大护符", "", 15, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	15003: &Item{
		15003, "神奇超大护符", "icon_05", "", 100, "我是超大护符", "", 15, 1, 0, "", 3, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	40000: &Item{
		40000, "雷霆之怒·逐风者", "icon_01", "", 100, "我是逐风者，我无所不在", "", 11, 0, 0, "", 0, 100, 1, 1, 0, 100, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 62, 
	},
	40001: &Item{
		40001, "巫师会的准则", "icon_02", "", 100, "我告诉你我就是城管的防爆盾", "", 11, 0, 0, "", 0, 100, 1, 1, 0, 200, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 62, 
	},
	40002: &Item{
		40002, "摄政仁君之凯", "icon_03", "", 100, "我可以用/n换行吗？", "", 11, 0, 0, "", 0, 100, 1, 1, 0, 300, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 62, 
	},
	40003: &Item{
		40003, "贵族钻石", "icon_04", "    ", 100, "可以被镶嵌", "", 12, 1, 0, "", 1, 99, 0, 2, 0, 400, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 118, 
	},
	40004: &Item{
		40004, "李奥瑞克的红宝石", "icon_05", "", 100, "珠宝是拿来看的么？", "", 13, 1, 0, "", 2, 98, 0, 999, 1, 500, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 118, 
	},
	40005: &Item{
		40005, "李奥瑞克的黄金护颈", "icon_06", "", 100, "确定这是护身符？信不信打死你- -！", "尽管这件华丽的护具拥有威力强大的魔法效果，但它还是没能阻止高贵的拉齐达南了结疯王的性命。", 14, 2, 0, "", 3, 97, 0, 2, 0, 600, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 118, 
	},
	40006: &Item{
		40006, "骷髅王肩铠", "icon_07", "", 100, "告诉你我是神符你得背着我！", "“就算价值连城，也不要去碰黑暗国王的衣冠，就让它随其殒命的主人一同永埋地底吧。打扰长眠的李奥瑞克是不会有好下场的。”—迪卡德·凯恩", 15, 2, 0, "", 4, 96, 0, 999, 0, 700, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 118, 
	},
	40100: &Item{
		40100, "骑士巨盔", "toukui_ls", "101001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 800, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40101: &Item{
		40101, "巨斧", "zhuwuqi02_ls", "102001", 100, "", "", 11, 0, 0, "", 0, 10, 1, 1, 0, 900, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40102: &Item{
		40102, "钢盾", "dunpai_ls", "103001", 100, "", "", 11, 0, 0, "", 0, 10, 1, 1, 0, 1000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 45, 
	},
	40103: &Item{
		40103, "乌木胸甲", "shangyi0_ls", "104001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1100, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40104: &Item{
		40104, "厚腰带", "yaodai_ls", "105001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1200, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40105: &Item{
		40105, "乌木裤", "kuzi01_ls", "106001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1300, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40106: &Item{
		40106, "秘银战靴", "xiezi02_ls", "107001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1400, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40107: &Item{
		40107, "宝石项链", "hufu_ls", "108001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1500, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40108: &Item{
		40108, "银戒指", "jiez01_ls", "109001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1600, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40109: &Item{
		40109, "黑钢护腕", "huwan01_ls", "110001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1700, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40110: &Item{
		40110, "天使之翼", "chibang_ls", "111001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1800, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40111: &Item{
		40111, "附魔手套", "hushou01_ls", "112001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1900, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	40112: &Item{
		40112, "精金护肩", "hujian01_ls", "113001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 2000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41000: &Item{
		41000, "小法杖", "icon_06", "113001", 100, "", "", 11, 0, 0, "", 0, 10, 3, 1, 0, 2000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41100: &Item{
		41100, "骑士巨盔", "toukui_ls", "101001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 800, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41101: &Item{
		41101, "巨斧", "zhuwuqi02_ls", "102001", 100, "", "", 11, 0, 0, "", 0, 10, 1, 1, 0, 900, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41102: &Item{
		41102, "钢盾", "dunpai_ls", "103001", 100, "", "", 11, 0, 0, "", 0, 10, 1, 1, 0, 1000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 45, 
	},
	41103: &Item{
		41103, "乌木胸甲", "shangyi0_ls", "104001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1100, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41104: &Item{
		41104, "厚腰带", "yaodai_ls", "105001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1200, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41105: &Item{
		41105, "乌木裤", "kuzi01_ls", "106001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1300, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41106: &Item{
		41106, "秘银战靴", "xiezi02_ls", "107001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1400, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41107: &Item{
		41107, "宝石项链", "hufu_ls", "108001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1500, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41108: &Item{
		41108, "银戒指", "jiez01_ls", "109001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1600, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41109: &Item{
		41109, "黑钢护腕", "huwan01_ls", "110001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1700, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41110: &Item{
		41110, "天使之翼", "chibang_ls", "111001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1800, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41111: &Item{
		41111, "附魔手套", "hushou01_ls", "112001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1900, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	41112: &Item{
		41112, "精金护肩", "hujian01_ls", "113001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 2000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42100: &Item{
		42100, "骑士巨盔", "toukui_ls", "101001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 800, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42101: &Item{
		42101, "巨斧", "zhuwuqi02_ls", "102001", 100, "", "", 11, 0, 0, "", 0, 10, 1, 1, 0, 900, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42102: &Item{
		42102, "钢盾", "dunpai_ls", "103001", 100, "", "", 11, 0, 0, "", 0, 10, 1, 1, 0, 1000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 45, 
	},
	42103: &Item{
		42103, "乌木胸甲", "shangyi0_ls", "104001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1100, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42104: &Item{
		42104, "厚腰带", "yaodai_ls", "105001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1200, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42105: &Item{
		42105, "乌木裤", "kuzi01_ls", "106001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1300, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42106: &Item{
		42106, "秘银战靴", "xiezi02_ls", "107001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1400, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42107: &Item{
		42107, "宝石项链", "hufu_ls", "108001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1500, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42108: &Item{
		42108, "银戒指", "jiez01_ls", "109001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1600, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42109: &Item{
		42109, "黑钢护腕", "huwan01_ls", "110001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1700, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42110: &Item{
		42110, "天使之翼", "chibang_ls", "111001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1800, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42111: &Item{
		42111, "附魔手套", "hushou01_ls", "112001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1900, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	42112: &Item{
		42112, "精金护肩", "hujian01_ls", "113001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 2000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43100: &Item{
		43100, "骑士巨盔", "toukui_ls", "101001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 800, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43101: &Item{
		43101, "巨斧", "zhuwuqi02_ls", "102001", 100, "", "", 11, 0, 0, "", 0, 10, 1, 1, 0, 900, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43102: &Item{
		43102, "钢盾", "dunpai_ls", "103001", 100, "", "", 11, 0, 0, "", 0, 10, 1, 1, 0, 1000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 45, 
	},
	43103: &Item{
		43103, "乌木胸甲", "shangyi0_ls", "104001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1100, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43104: &Item{
		43104, "厚腰带", "yaodai_ls", "105001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1200, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43105: &Item{
		43105, "乌木裤", "kuzi01_ls", "106001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1300, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43106: &Item{
		43106, "秘银战靴", "xiezi02_ls", "107001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1400, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43107: &Item{
		43107, "宝石项链", "hufu_ls", "108001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1500, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43108: &Item{
		43108, "银戒指", "jiez01_ls", "109001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1600, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43109: &Item{
		43109, "黑钢护腕", "huwan01_ls", "110001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1700, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43110: &Item{
		43110, "天使之翼", "chibang_ls", "111001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1800, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43111: &Item{
		43111, "附魔手套", "hushou01_ls", "112001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 1900, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	43112: &Item{
		43112, "精金护肩", "hujian01_ls", "113001", 100, "", "", 11, 0, 0, "", 0, 10, 0, 1, 0, 2000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, "", "", 61, 
	},
	45001: &Item{
		45001, "行尸肉块", "icon_04", "108001", 100, "任务道具", "行尸肉块", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45002: &Item{
		45002, "活死人肉块", "icon_05", "108001", 100, "任务道具", "活死人肉块", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45003: &Item{
		45003, "修女头巾", "icon_04", "108001", 100, "任务道具", "修女头巾", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45004: &Item{
		45004, "腐化精华", "icon_05", "108001", 100, "任务道具", "腐化精华", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45005: &Item{
		45005, "残页碎片", "icon_04", "108001", 100, "任务道具", "残页碎片", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45006: &Item{
		45006, "十字项链", "icon_05", "108001", 100, "任务道具", "十字项链", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45007: &Item{
		45007, "陨石粉尘", "icon_04", "108001", 100, "任务道具", "陨石粉尘", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45008: &Item{
		45008, "手绘地图", "icon_05", "108001", 100, "任务道具", "手绘地图", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45009: &Item{
		45009, "密道钥匙", "icon_04", "108001", 100, "任务道具", "密道钥匙", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45010: &Item{
		45010, "暗月密令", "icon_05", "108001", 100, "任务道具", "暗月密令", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45011: &Item{
		45011, "爱戴的心", "icon_04", "108001", 100, "任务道具", "爱戴的心", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
	45012: &Item{
		45012, "李奥瑞克日记", "icon_05", "108001", 100, "任务道具", "李奥瑞克日记", 40, 1, 0, "", 0, 1, 0, 999, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, "", "", 0, 
	},
}

	func Item_hot() {
		for _, val := range cnfItem	{
			v := reflect.ValueOf(*val)
			t := reflect.TypeOf(*val)
			fmt.Printf("%s",t.Name())
			for k := 0; k < v.NumField(); k++ {
				if strings.Contains(v.Field(k).Type().String(), "_Json") {}
			}
		}
	}